In [1]:
#pandas.Series( data, index, dtype, copy)
import pandas as pd
s = pd.Series()
print(s)

Series([], dtype: float64)

c:\users\user\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

In [7]:
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [3]:
import pandas as pd
import numpy as np
data = (['a','b','c','d'])
s = pd.Series(data,index = [100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: object

In [4]:
import pandas as pd
import numpy as np
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
print(s)

a    0.0
b    1.0
c    2.0
dtype: float64

In [5]:
import pandas as pd
import numpy as np
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data,index = ['b','c','d','a'])
print(s)
##Index order is persisted and the missing element is filled with NaN (Not a Number).

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [6]:
import pandas as pd
import numpy as np
s = pd.Series(5, index=[0, 1, 2, 3, 4])
print(s)

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [7]:
import pandas as pd
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve the first element
print(s[0])

1

In [8]:
import pandas as pd
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve the first three element
print( s[:3])

a    1
b    2
c    3
dtype: int64

In [9]:
#Retrieve a single element using index label value.
import pandas as pd
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve a single element
print(s['a'])
#retrieve multiple elements
print(s[['a','c','d']])

1
a    1
c    3
d    4
dtype: int64

In [10]:
#pandas.DataFrame( data, index, columns, dtype, copy)
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [11]:
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [12]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print(df)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [13]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
print(df)

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [14]:
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [15]:
#Let us now create an indexed DataFrame using arrays.
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
print(df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [16]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
print(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [17]:
#The following example shows how to create a DataFrame by passing a list of dictionaries and the row indices.
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])
print(df)

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [18]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

#With two column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])

#With two column indices with one index with other name
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1'])
print(df1)
print(df2)

        a   b
first   1   2
second  5  10
        a  b1
first   1 NaN
second  5 NaN

In [19]:
#Create a DataFrame from Dict of Series
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [20]:
#to print one column of a dataframe
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df['one'])

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [21]:
#adding column
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)

# Adding a new column to an existing DataFrame object with column label by passing new series

print ("Adding a new column by passing as Series:")
df['three']=pd.Series([10,20,30],index=['a','b','c'])
print(df)

print ("Adding a new column using the existing columns in DataFrame:")
df['four']=df['one']+df['three']

print(df)

Adding a new column by passing as Series:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN
Adding a new column using the existing columns in DataFrame:
   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [22]:
#deleting a column
# Using the previous DataFrame, we will delete a column
# using del function
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
   'three' : pd.Series([10,20,30], index=['a','b','c'])}

df = pd.DataFrame(d)
print ("Our dataframe is:")
print(df)

# using del function
print ("Deleting the first column using DEL function:")
del df['one']
print(df)

# using pop function
print ("Deleting another column using POP function:")
df.pop('two')
print(df)

Our dataframe is:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN
Deleting the first column using DEL function:
   two  three
a    1   10.0
b    2   20.0
c    3   30.0
d    4    NaN
Deleting another column using POP function:
   three
a   10.0
b   20.0
c   30.0
d    NaN

In [2]:
#row selection,additon,deletion
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df.loc['b'])

one    2.0
two    2.0
Name: b, dtype: float64

In [24]:
#Rows can be selected by passing integer location to an iloc function.
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df.iloc[2])

one    3.0
two    3.0
Name: c, dtype: float64

In [25]:
#slicing rows
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df[2:4])

   one  two
c  3.0    3
d  NaN    4

In [26]:
#addition of rows
import pandas as pd

df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
print((df))

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [27]:
#deletion of rows
import pandas as pd

df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)

# Drop rows with label 0
df = df.drop(0)

print(df)

   a  b
1  3  4
1  7  8

In [28]:
import pandas as pd
import numpy as np
dict = {
    "name" : ['sumit','abhi','satyam','kunal'],
    "marks": [66,77,44,99],
    "city" : ['panchkula','mohali','derabassi','pkl']
}
df = pd.DataFrame(dict)
df

     name  marks       city
0   sumit     66  panchkula
1    abhi     77     mohali
2  satyam     44  derabassi
3   kunal     99        pkl

In [29]:
df.to_csv('friends.csv')

In [30]:
df.to_csv('friends_indexfalse.csv', index = False)

In [31]:
df.head(2)

    name  marks       city
0  sumit     66  panchkula
1   abhi     77     mohali

In [32]:
df.tail(2)

     name  marks       city
2  satyam     44  derabassi
3   kunal     99        pkl

In [33]:
df.describe()

           marks
count   4.000000
mean   71.500000
std    22.898326
min    44.000000
25%    60.500000
50%    71.500000
75%    82.500000
max    99.000000

In [34]:
sumit = pd.read_csv('sumit.csv')

In [35]:
sumit

   Unnamed: 0  Train  Speed       City
0           0  24542     56  panchkula
1           1  23323     77     mohali
2           2  56765     23  derabassi
3           3  34533     35        pkl

In [36]:
sumit['Speed'][0] = 56

c:\users\user\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [37]:
sumit

   Unnamed: 0  Train  Speed       City
0           0  24542     56  panchkula
1           1  23323     77     mohali
2           2  56765     23  derabassi
3           3  34533     35        pkl

In [38]:
sumit.to_csv('sumit.csv')

In [39]:
sumit.index = ['first','second','third','fourth']

In [40]:
sumit

        Unnamed: 0  Train  Speed       City
first            0  24542     56  panchkula
second           1  23323     77     mohali
third            2  56765     23  derabassi
fourth           3  34533     35        pkl

In [41]:
ser = pd.Series(np.random.rand(34))

In [42]:
ser

0     0.832096
1     0.806426
2     0.044234
3     0.855644
4     0.055076
5     0.353854
6     0.746937
7     0.246552
8     0.105718
9     0.770542
10    0.674654
11    0.088652
12    0.860051
13    0.965518
14    0.981718
15    0.954185
16    0.698904
17    0.321612
18    0.926782
19    0.027131
20    0.262256
21    0.748214
22    0.928143
23    0.052713
24    0.237017
25    0.261637
26    0.636630
27    0.068769
28    0.573489
29    0.005164
30    0.522736
31    0.429136
32    0.364953
33    0.837847
dtype: float64

In [43]:
type(ser)

pandas.core.series.Series

In [44]:
newdf = pd.DataFrame(np.random.rand(334,5),index = np.arange(334))

In [45]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.222485  0.927065  0.500935  0.158478  0.420788
1  0.159764  0.777857  0.440856  0.166703  0.632462
2  0.380283  0.381656  0.709880  0.289319  0.620908
3  0.372695  0.851535  0.699521  0.987499  0.286302
4  0.066809  0.442057  0.625448  0.848223  0.953269

In [46]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.479260    0.495864    0.499165    0.508416    0.496391
std      0.276870    0.292852    0.273505    0.297291    0.276660
min      0.008053    0.004929    0.007358    0.004911    0.007212
25%      0.237346    0.242217    0.285079    0.249357    0.268889
50%      0.456544    0.488125    0.491823    0.532269    0.493837
75%      0.709755    0.764389    0.722437    0.771382    0.715698
max      0.992491    0.999110    0.998762    0.998075    0.994272

In [47]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [48]:
newdf[0][0] = "sumit"

In [49]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [50]:
#to print indexes
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [51]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [52]:
newdf[0][0] = 0.3433353

c:\users\user\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [53]:
#to change df into numpy
newdf.to_numpy()

array([[0.3433353, 0.9270648393404378, 0.5009350458788622,
        0.15847846053343595, 0.4207882382572443],
       [0.15976404645967712, 0.7778570357553395, 0.4408557411621157,
        0.1667028011992261, 0.632462473645239],
       [0.3802827089635139, 0.38165611103881647, 0.7098796589449724,
        0.28931873210276704, 0.6209075473640794],
       ...,
       [0.6532166232480855, 0.7867123294943265, 0.6528338793186967,
        0.9654266995266199, 0.6153327250726163],
       [0.6931117897100956, 0.42408427990876085, 0.9674326119806359,
        0.04201208661087197, 0.14080729967040218],
       [0.9817180297230317, 0.26423260073268995, 0.7343194104525791,
        0.24793416980025162, 0.8144861908904159]], dtype=object)

In [54]:
#to transpose the data
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.343335,0.159764,0.380283,0.372695,0.0668092,0.407103,0.479128,0.3676,0.957822,0.938091,...,0.384506,0.72026,0.818067,0.487377,0.283976,0.444016,0.557163,0.653217,0.693112,0.981718
1,0.927065,0.777857,0.381656,0.851535,0.442057,0.372843,0.474517,0.73879,0.675632,0.724985,...,0.428844,0.341529,0.680458,0.211074,0.939041,0.904619,0.331932,0.786712,0.424084,0.264233
2,0.500935,0.440856,0.70988,0.699521,0.625448,0.735364,0.85158,0.786588,0.173924,0.948484,...,0.195406,0.498475,0.795128,0.271624,0.764025,0.789224,0.787993,0.652834,0.967433,0.734319
3,0.158478,0.166703,0.289319,0.987499,0.848223,0.576777,0.977865,0.586765,0.340436,0.121874,...,0.864517,0.685564,0.300304,0.155246,0.814614,0.656678,0.0306358,0.965427,0.0420121,0.247934
4,0.420788,0.632462,0.620908,0.286302,0.953269,0.277206,0.691517,0.0337361,0.633021,0.409391,...,0.830013,0.110418,0.196403,0.979478,0.43531,0.50742,0.301301,0.615333,0.140807,0.814486

In [55]:
# Sorting acc. to indexes
#newdf.sort_index(axis = 0, ascending = False)
#newdf.sort_index(axis = 0)
newdf.sort_index(axis = 1, ascending = False) #for sorting in columns

            4         3         2         1          0
0    0.420788  0.158478  0.500935  0.927065   0.343335
1    0.632462  0.166703  0.440856  0.777857   0.159764
2    0.620908  0.289319  0.709880  0.381656   0.380283
3    0.286302  0.987499  0.699521  0.851535   0.372695
4    0.953269  0.848223  0.625448  0.442057  0.0668092
..        ...       ...       ...       ...        ...
329  0.507420  0.656678  0.789224  0.904619   0.444016
330  0.301301  0.030636  0.787993  0.331932   0.557163
331  0.615333  0.965427  0.652834  0.786712   0.653217
332  0.140807  0.042012  0.967433  0.424084   0.693112
333  0.814486  0.247934  0.734319  0.264233   0.981718

[334 rows x 5 columns]

In [56]:
#newdf2 act as a pointer
#newdf2 = newdf
#now newdf2 act as a copy
newdf2 = newdf.copy()

In [57]:
newdf2[0][0] = 334233

c:\users\user\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [58]:
newdf

             0         1         2         3         4
0     0.343335  0.927065  0.500935  0.158478  0.420788
1     0.159764  0.777857  0.440856  0.166703  0.632462
2     0.380283  0.381656  0.709880  0.289319  0.620908
3     0.372695  0.851535  0.699521  0.987499  0.286302
4    0.0668092  0.442057  0.625448  0.848223  0.953269
..         ...       ...       ...       ...       ...
329   0.444016  0.904619  0.789224  0.656678  0.507420
330   0.557163  0.331932  0.787993  0.030636  0.301301
331   0.653217  0.786712  0.652834  0.965427  0.615333
332   0.693112  0.424084  0.967433  0.042012  0.140807
333   0.981718  0.264233  0.734319  0.247934  0.814486

[334 rows x 5 columns]

In [59]:
#to ignore warning message for assigning a value in data
newdf.loc[0,0] = 884928

In [60]:
newdf.head(2)

          0         1         2         3         4
0    884928  0.927065  0.500935  0.158478  0.420788
1  0.159764  0.777857  0.440856  0.166703  0.632462

In [61]:
newdf.columns = list("ABCDE")

In [62]:
newdf.head()

           A         B         C         D         E
0     884928  0.927065  0.500935  0.158478  0.420788
1   0.159764  0.777857  0.440856  0.166703  0.632462
2   0.380283  0.381656  0.709880  0.289319  0.620908
3   0.372695  0.851535  0.699521  0.987499  0.286302
4  0.0668092  0.442057  0.625448  0.848223  0.953269

In [63]:
newdf.loc[0,0] = 393 # this will add a new column beacuse 0th column doesn't exists

In [64]:
newdf.head()

           A         B         C         D         E      0
0     884928  0.927065  0.500935  0.158478  0.420788  393.0
1   0.159764  0.777857  0.440856  0.166703  0.632462    NaN
2   0.380283  0.381656  0.709880  0.289319  0.620908    NaN
3   0.372695  0.851535  0.699521  0.987499  0.286302    NaN
4  0.0668092  0.442057  0.625448  0.848223  0.953269    NaN

In [65]:
newdf.loc[0,'A'] = 383893

In [66]:
newdf.head()

           A         B         C         D         E      0
0     383893  0.927065  0.500935  0.158478  0.420788  393.0
1   0.159764  0.777857  0.440856  0.166703  0.632462    NaN
2   0.380283  0.381656  0.709880  0.289319  0.620908    NaN
3   0.372695  0.851535  0.699521  0.987499  0.286302    NaN
4  0.0668092  0.442057  0.625448  0.848223  0.953269    NaN

In [67]:
newdf = newdf.drop(0,axis = 1)

In [68]:
newdf.head()

           A         B         C         D         E
0     383893  0.927065  0.500935  0.158478  0.420788
1   0.159764  0.777857  0.440856  0.166703  0.632462
2   0.380283  0.381656  0.709880  0.289319  0.620908
3   0.372695  0.851535  0.699521  0.987499  0.286302
4  0.0668092  0.442057  0.625448  0.848223  0.953269

In [69]:
# to reach specific data in specific columns and rows
newdf.loc[[1,7],['C','B']]

          C         B
1  0.440856  0.777857
7  0.786588  0.738790

In [70]:
#newdf.loc[:,['A','D']]
newdf.loc[[1,2],:]

          A         B         C         D         E
1  0.159764  0.777857  0.440856  0.166703  0.632462
2  0.380283  0.381656  0.709880  0.289319  0.620908

In [71]:
#to find result acc. to user
newdf.loc[(newdf['C']<0.3) & (newdf['A']>0.1)]

            A         B         C         D         E
8    0.957822  0.675632  0.173924  0.340436  0.633021
15   0.853011  0.700689  0.281246  0.888393  0.937160
16   0.235897  0.236178  0.236368  0.396293  0.042576
18   0.695865  0.653690  0.083057  0.594560  0.800629
19    0.20176  0.322088  0.135176  0.253627  0.902653
..        ...       ...       ...       ...       ...
319  0.785426  0.727829  0.038705  0.082259  0.076397
322  0.442269  0.061360  0.038958  0.727106  0.434318
323  0.930654  0.758132  0.187075  0.992864  0.964838
324  0.384506  0.428844  0.195406  0.864517  0.830013
327  0.487377  0.211074  0.271624  0.155246  0.979478

[83 rows x 5 columns]

In [72]:
newdf.head()

           A         B         C         D         E
0     383893  0.927065  0.500935  0.158478  0.420788
1   0.159764  0.777857  0.440856  0.166703  0.632462
2   0.380283  0.381656  0.709880  0.289319  0.620908
3   0.372695  0.851535  0.699521  0.987499  0.286302
4  0.0668092  0.442057  0.625448  0.848223  0.953269

In [73]:
# if column name isn't specified but we know where the data present
newdf.iloc[0,4]

0.4207882382572443

In [74]:
newdf.iloc[[0,1],[1,2]]

          B         C
0  0.927065  0.500935
1  0.777857  0.440856

In [75]:
# to drop a column or a row
#newdf.drop([0],axis = 0)#axis =1 if wanna to drop column and['name of column']
newdf.drop(['A','B'],axis = 1, inplace = True)# use inplace if want to save changes of your data

In [76]:
newdf.drop([1,6],axis = 0, inplace = True)

In [77]:
newdf

            C         D         E
0    0.500935  0.158478  0.420788
2    0.709880  0.289319  0.620908
3    0.699521  0.987499  0.286302
4    0.625448  0.848223  0.953269
5    0.735364  0.576777  0.277206
..        ...       ...       ...
329  0.789224  0.656678  0.507420
330  0.787993  0.030636  0.301301
331  0.652834  0.965427  0.615333
332  0.967433  0.042012  0.140807
333  0.734319  0.247934  0.814486

[332 rows x 3 columns]

In [78]:
#how to reset indexes
newdf.reset_index(drop= True,inplace= True)

In [79]:
newdf.head()

          C         D         E
0  0.500935  0.158478  0.420788
1  0.709880  0.289319  0.620908
2  0.699521  0.987499  0.286302
3  0.625448  0.848223  0.953269
4  0.735364  0.576777  0.277206

In [80]:
#it return true where it find zeroo
newdf['C'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: C, Length: 332, dtype: bool

In [81]:
#if we wanna assign value null to column 'C'
newdf.loc[:,['C']] = 43

In [82]:
newdf['C'].notnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: C, Length: 332, dtype: bool

In [8]:
df = pd.DataFrame({
        "name" : ['sumit','satyam','sumit'],
        "toy"  : [np.nan,'batmobile','bullwhish'],
        "born" : [pd.NaT, pd.Timestamp("1940-3-21"),pd.NaT]
    
})

In [9]:
df

     name        toy       born
0   sumit        NaN        NaT
1  satyam  batmobile 1940-03-21
2   sumit  bullwhish        NaT

In [10]:
df.dropna(how = "all",axis = 1) # if all are na in a column

     name        toy       born
0   sumit        NaN        NaT
1  satyam  batmobile 1940-03-21
2   sumit  bullwhish        NaT

In [11]:
#df.drop_duplicates(subset=['name'],keep="last") # keep will take one argument (first,last,false)
df.drop_duplicates(subset=['name'],keep = "first")

     name        toy       born
0   sumit        NaN        NaT
1  satyam  batmobile 1940-03-21

In [12]:
df.shape

(3, 3)

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 112.0+ bytes

In [89]:
df['name'].value_counts(dropna = False)

sumit     2
satyam    1
Name: name, dtype: int64

In [90]:
pip install xlrd

Requirement already satisfied: xlrd in c:\users\user\appdata\local\programs\python\python37-32\lib\site-packages (1.2.0)Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.3.1; however, version 20.3.3 is available.
You should consider upgrading via the 'c:\users\user\appdata\local\programs\python\python37-32\python.exe -m pip install --upgrade pip' command.

In [16]:
data = pd.read_excel("data2.xlsx",sheet_name = 'Sheet2')

In [17]:
data

   Unnamed: 0  Unnamed: 0.1  Train no  Speeds2     Cityc2
0           0        120420    120420       89  panchkula
1           1             1     23323       77     mohali
2           2             2     56765       23  derabassi
3           3             3     34533       35        pkl

In [18]:
data.iloc[0,0] = 120420

In [19]:
data

   Unnamed: 0  Unnamed: 0.1  Train no  Speeds2     Cityc2
0      120420        120420    120420       89  panchkula
1           1             1     23323       77     mohali
2           2             2     56765       23  derabassi
3           3             3     34533       35        pkl

In [20]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\user\appdata\local\programs\python\python37-32\lib\site-packages (3.0.5)Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.3.1; however, version 20.3.3 is available.
You should consider upgrading via the 'c:\users\user\appdata\local\programs\python\python37-32\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: jdcal in c:\users\user\appdata\local\programs\python\python37-32\lib\site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in c:\users\user\appdata\local\programs\python\python37-32\lib\site-packages (from openpyxl) (1.0.1)

In [21]:
data

   Unnamed: 0  Unnamed: 0.1  Train no  Speeds2     Cityc2
0      120420        120420    120420       89  panchkula
1           1             1     23323       77     mohali
2           2             2     56765       23  derabassi
3           3             3     34533       35        pkl

In [24]:
data2 = data.copy()

with pd.ExcelWriter('data2.xlsx') as writter:
    data.to_excel(writter, sheet_name = 'Sheet1')
    data2.to_excel(writter, sheet_name = 'Sheet2')